#  Итоговый проект по автоматизации тестирования:
Объект тестирования: [Ростелеком](https://b2c.passport.rt.ru)

### Для тестирования сайта были использованы:
- ручные и автоматизированные тесты
- разбиение на классы эквивалентности
- анализ граничных значений
- тестирование состояний и переходов

### [чек-лист/тест-кейсы/баг-репорты](https://1drv.ms/x/s!Al0mMJVTqsVNgwzQIcgb8DBeCcKa?e=uMrYMa)
### Тесты настроены на запуск через Run! 
### Страница восстановления пароля (как позитивные, так и негативные тесты) требует РУЧНОЙ ВВОД СИМВОЛОВ С КАРТИНКИ !!!

---------------------
### Папка tests: 
test_negative_auth_page - тестируем негативные сценарии страницы авторизации
test_negative_reg_page - тестируем негативные сценарии страницы регистрации
test_negative_new_pass_page - тестируем негативные сценарии страницы восстановления пароля
test_positive_auth_page - тестируем позитивные сценарии страницы авторизации
test_positive_reg_page - тестируем позитивные сценарии страницы регистрации
test_positive_new_pass_page - тестируем позитивные сценарии страницы восстановления пароля

### Папка pages: 
Api_RegMail - GET-запросы к виртуальному почтовому ящику (1secmail.com) для получения валидного 
Email и кода для регистрации на сайте.

locators - локаторы XPath и CSS на web-элементы сайта

auth - функции-обёртки для локаторов, распределённые по классам в зависимости от тематики тестов

base - функции для применения к локаторам явных ожиданий, получения главной страницы сайта и пути текущей страницы

config - исходные статические данные

settings - учетные данные, используемые в процессе теста
